src/Documents/АктПередачиЖивотного/АктПередачиЖивотного.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>АктПередачиЖивотного</name>
  <registerRecords>AccumulationRegister.ДвиженияЖивотных</registerRecords>
  <attributes>
    <name>ТипАкта</name>
    <type>
      <types>EnumRef.ТипАкта</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудник</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СоставАкта</name>
    <attributes>
      <name>Котик</name>
      <type>
        <types>CatalogRef.Котики</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/AccumulationRegisters/ДвиженияЖивотных/ДвиженияЖивотных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДвиженияЖивотных</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Акт</name>
    <type>
      <types>EnumRef.ТипАкта</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Documents/АктПередачиЖивотного/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ДвиженияЖивотных 
	Движения.ДвиженияЖивотных.Записывать = Истина;
	Для Каждого ТекСтрокаСоставАкта Из СоставАкта Цикл
		Движение = Движения.ДвиженияЖивотных.Добавить();
		Движение.Период = Дата;
		Движение.Акт = ТипАкта;
		Движение.Количество = ТекСтрокаСоставАкта.НомерСтроки;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
